src/Catalogs/уатШаблоныЗаполненияПоУслугам/уатШаблоныЗаполненияПоУслугам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатШаблоныЗаполненияПоУслугам</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СтандартныеНастройкиПоступление</name>
      <description>Стандартные настройки для поступления услуг</description>
    </items>
    <items>
      <name>СтандартныеНастройкиРеализация</name>
      <description>Стандартные настройки для реализации услуг</description>
    </items>
  </predefined>
  <attributes>
    <name>РежимЗаполнения</name>
    <comment>0 - предоставленными, 1 - невыставленными</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательУслуг</name>
    <type>
      <types>EnumRef.уатПолучателиУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СворачиватьПоПолямДетализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДанныеТТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДанныеЗаказНаТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДанныеЗаказПеревозчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДанныеМаршрутныйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДанныеКорректировкаЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДанныеРекламаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаЗаказов</name>
    <comment>0 - дата заказа , 1 - время отправления, 2 - время прибытия</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетализацияЗаполнения</name>
    <attributes>
      <name>ПолеРегистра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/уатШаблоныЗаполненияПоУслугам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	Макет = Справочники.уатШаблоныЗаполненияПоУслугам.ПолучитьМакет("НастройкиПредопределенныхЭлементов");
	ОбластьНастроек = Макет.ПолучитьОбласть("Строки|Колонки");
	
	Для НомерСтроки = 1 По ОбластьНастроек.ВысотаТаблицы Цикл
		ИмяПредопрЭлемента = ОбластьНастроек.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		
		Попытка
			ТекЭлемент = Справочники.уатШаблоныЗаполненияПоУслугам[ИмяПредопрЭлемента];
		Исключение
			Продолжить;
		КонецПопытки;
		
		СпрОбъект = ТекЭлемент.ПолучитьОбъект();
		
		СпрОбъект.ПолучательУслуг                        = Перечисления.уатПолучателиУслуг[ОбластьНастроек.Область(НомерСтроки, 2, НомерСтроки, 2).Текст];
		СпрОбъект.РежимЗаполнения                        = Число(ОбластьНастроек.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		СпрОбъект.СворачиватьПоПолямДетализации          = Число(ОбластьНастроек.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		СпрОбъект.ИспользоватьДанныеТТД                  = Число(ОбластьНастроек.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
		СпрОбъект.ИспользоватьДанныеЗаказНаТС            = Число(ОбластьНастроек.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			СпрОбъект.ИспользоватьДанныеЗаказПеревозчику = Число(ОбластьНастроек.Область(НомерСтроки, 7, НомерСтроки, 7).Текст);
			СпрОбъект.ИспользоватьДанныеМаршрутныйЛист   = Число(ОбластьНастроек.Область(НомерСтроки, 8, НомерСтроки, 8).Текст);
		КонецЕсли;
		СпрОбъект.ИспользоватьДанныеКорректировкаЗаписей = Число(ОбластьНастроек.Область(НомерСтроки, 9, НомерСтроки, 9).Текст);
		СпрОбъект.СортировкаЗаказов                      = Число(ОбластьНастроек.Область(НомерСтроки, 10, НомерСтроки, 10).Текст);
		СпрОбъект.ИспользоватьДанныеРекламаций           = Число(ОбластьНастроек.Область(НомерСтроки, 10, НомерСтроки, 11).Текст);
		
		СпрОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
